Revit 2025 API
GBXMLExportOptions.Encoding Property
 The encoding options to go into the processing instruction for the exported gbXML file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public string Encoding { get; }
Public ReadOnly Property Encoding As String
	Get
public:
property String^ Encoding {
	String^ get ();
}
member Encoding : string with get
Property Value
String
See Also
Reference
GBXMLExportOptions Class
Autodesk.Revit.DB Namespace